; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	image2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(have_image Planet5 infrared1)
	(have_image Phenomenon6 image0)
	(have_image Star7 image2)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 image0)
	(have_image Phenomenon10 image2)
	(have_image Star11 infrared1)
	(have_image Planet12 infrared1)
	(have_image Phenomenon13 image2)
	(have_image Star14 image2)
	(have_image Star15 infrared1)
	(have_image Planet16 image2)
	(have_image Phenomenon17 image2)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 phenomenon6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 13
5. (take_image satellite0 phenomenon6 instrument0 image0)
   added: (have_image phenomenon6 image0)
   goals met: 1 of 13
6. (turn_to satellite0 phenomenon17 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 13
7. (take_image satellite0 phenomenon17 instrument0 image2)
   added: (have_image phenomenon17 image2)
   goals met: 2 of 13
8. (turn_to satellite0 phenomenon13 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 13
9. (take_image satellite0 phenomenon13 instrument0 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon10 instrument0 image2)
   added: (have_image phenomenon10 image2)
   goals met: 4 of 13
12. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 13
13. (take_image satellite0 phenomenon9 instrument0 image0)
   added: (have_image phenomenon9 image0)
   goals met: 5 of 13
14. (turn_to satellite0 planet12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet12)
   goals met: 5 of 13
15. (take_image satellite0 planet12 instrument0 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 6 of 13
16. (turn_to satellite0 planet16 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet16)
   goals met: 6 of 13
17. (take_image satellite0 planet16 instrument0 image2)
   added: (have_image planet16 image2)
   goals met: 7 of 13
18. (turn_to satellite0 planet5 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet5)
   goals met: 7 of 13
19. (take_image satellite0 planet5 instrument0 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 8 of 13
20. (turn_to satellite0 star11 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star11)
   goals met: 8 of 13
21. (take_image satellite0 star11 instrument0 infrared1)
   added: (have_image star11 infrared1)
   goals met: 9 of 13
22. (turn_to satellite0 star14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star14)
   goals met: 9 of 13
23. (take_image satellite0 star14 instrument0 image2)
   added: (have_image star14 image2)
   goals met: 10 of 13
24. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 10 of 13
25. (take_image satellite0 star15 instrument0 infrared1)
   added: (have_image star15 infrared1)
   goals met: 11 of 13
26. (turn_to satellite0 star7 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star7)
   goals met: 11 of 13
27. (take_image satellite0 star7 instrument0 image2)
   added: (have_image star7 image2)
   goals met: 12 of 13
28. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 12 of 13
29. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 13 of 13
